#include "main.h"


/************************************************
CRC循环冗余校验

2018/6/25

测试无问题
************************************************/





/******************************************************************** 
* 名称： CRC16Check                 
* 功能： 16位CRC校验                
* 入口参数：校验位                                                                
* 出口参数：转换后的校验值，编码器  
*******************************************************************/ 
short int CRC16Check (unsigned char *buf,int len)
{unsigned short crc=0xFFFF;
    unsigned short c,i;
    while(len!=0)
    {
        c=*buf;
        for(i=0;i<8;i++)
        {
          if((crc ^ c) & 1)
             crc=(crc>>1)^0xa001;
          else
             crc>>=1;
          c>>=1;
        }
        len--;
        buf++;
    }
    return crc;
}

